# 앤스콤 데이터 집합 불러오기

# matplotlib 라이브러리로 간단한 그래프 그리기

# 한 번에 4개의 그래프 그리기

# 기초 그래프 그리기 - 히스토그램, 산점도, 박스 그래프

# 단변량 그래프 그리기 - 히스토그램

# 다변량 그래프 그리기

# 데이터프레임과 시리즈로 그래프 그리기

# 알아두면 좋아요

In [ ]:
Pandas를 사용하는 이유는 ?? 

- 데이터 전처리 라이브러리
- 분석하기 좋은 형태
- 머신러닝 , 딥러닝 등 학습에 적합한 데이터로 바꿔준다. 또는 다차원의 형태로 변경가능 

- 데이터를 2차원의 표 형태로 표현한다.
- 하나의 값으로만 이루어져야한다. (null, Nan, 주소(도시별,구별 ))

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
tips = sns.load_dataset('tips') #seaborn에서 제공하는 tips 예시

In [3]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [5]:
tips['sex'].astype(str)  #astype 은 데이터 형을 변환시켜준다. . 원본은 바뀌지 않는다.

0      Female
1        Male
2        Male
3        Male
4      Female
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 244, dtype: object

In [6]:
tips['sex'] = tips['sex'].astype(str) #데이터프레임에 변경한 값을 넣어주면 원본도 바뀌게 된다.

In [7]:
copy=True

In [8]:
tips['sex1'] =tips['sex'].astype(str,copy=False)

In [9]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex1        244 non-null    object
dtypes: category(3), float64(2), int64(1), object(2)
memory usage: 10.7+ KB

In [10]:
tips['size'].astype('category')#데이터타입을 변경시켜준다.

0      2
1      3
2      3
3      2
4      4
      ..
239    3
240    2
241    2
242    2
243    2
Name: size, Length: 244, dtype: category
Categories (6, int64): [1, 2, 3, 4, 5, 6]

In [11]:
tips['sex1'] = tips['sex'].astype(str,copy=False)

In [12]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex1        244 non-null    object
dtypes: category(3), float64(2), int64(1), object(2)
memory usage: 10.7+ KB

In [13]:
tips['tip'].astype('datetime64[ns, US/Eastern]')

0     1970-01-01 00:00:00.000000001-05:00
1     1970-01-01 00:00:00.000000001-05:00
2     1970-01-01 00:00:00.000000003-05:00
3     1970-01-01 00:00:00.000000003-05:00
4     1970-01-01 00:00:00.000000003-05:00
                      ...
239   1970-01-01 00:00:00.000000005-05:00
240   1970-01-01 00:00:00.000000002-05:00
241   1970-01-01 00:00:00.000000002-05:00
242   1970-01-01 00:00:00.000000001-05:00
243   1970-01-01 00:00:00.000000003-05:00
Name: tip, Length: 244, dtype: datetime64[ns, US/Eastern]

In [14]:
tips_missing = tips.loc[[1,3,5,7]]

In [15]:
tips_missing

   total_bill   tip   sex smoker  day    time  size  sex1
1       10.34  1.66  Male     No  Sun  Dinner     3  Male
3       23.68  3.31  Male     No  Sun  Dinner     2  Male
5       25.29  4.71  Male     No  Sun  Dinner     4  Male
7       26.88  3.12  Male     No  Sun  Dinner     4  Male

In [16]:
tips_missing.loc[[1,5],'total_bill'] = 'missing'   #이렇게 str을 넣으면 tips_missing의 Dtype이 Object로 바뀐다.

In [17]:
tips_missing

  total_bill   tip   sex smoker  day    time  size  sex1
1    missing  1.66  Male     No  Sun  Dinner     3  Male
3      23.68  3.31  Male     No  Sun  Dinner     2  Male
5    missing  4.71  Male     No  Sun  Dinner     4  Male
7      26.88  3.12  Male     No  Sun  Dinner     4  Male

In [18]:
tips_missing.info() #

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 7
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  4 non-null      object
 1   tip         4 non-null      float64
 2   sex         4 non-null      object
 3   smoker      4 non-null      category
 4   day         4 non-null      category
 5   time        4 non-null      category
 6   size        4 non-null      int64
 7   sex1        4 non-null      object
dtypes: category(3), float64(1), int64(1), object(3)
memory usage: 748.0+ bytes

In [19]:
tips_missing['total_bill'].astype(float) #오류가 발생한다.

ValueError: could not convert string to float: 'missing'

In [20]:
pd.to_numeric(tips_missing['total_bill'],errors='ignore') #오류가 발생해도 errors=ignore로 오류를 무시할 수 있다.  to_numeric은 오류가 났을때 처리가 가능한

1    missing
3      23.68
5    missing
7      26.88
Name: total_bill, dtype: object

In [21]:
pd.to_numeric(tips_missing['total_bill'],errors='coerce') #dtype이 float64

1      NaN
3    23.68
5      NaN
7    26.88
Name: total_bill, dtype: float64

In [22]:
pd.to_numeric(tips_missing['total_bill'],errors='coerce',downcast='float') #float32로 다운캐스팅한다. 왜냐하면 데이터

1          NaN
3    23.680000
5          NaN
7    26.879999
Name: total_bill, dtype: float32

In [23]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex1        244 non-null    object
dtypes: category(3), float64(2), int64(1), object(2)
memory usage: 10.7+ KB

In [24]:
tips['sex'] = tips['sex'].astype('str')   #memory usage: 10.7+ KB 메모리의 사용량을 보면

In [25]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex1        244 non-null    object
dtypes: category(3), float64(2), int64(1), object(2)
memory usage: 10.7+ KB

In [26]:
tips['sex'] = tips['sex'].astype('category') #타입을 다시 category로 바꿔준다.

In [27]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   sex1        244 non-null    object
dtypes: category(4), float64(2), int64(1), object(1)
memory usage: 9.2+ KB

In [29]:
pew = pd.read_csv('../data/pew.csv')

In [30]:
pew.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   religion            18 non-null     object
 1   <$10k               18 non-null     int64
 2   $10-20k             18 non-null     int64
 3   $20-30k             18 non-null     int64
 4   $30-40k             18 non-null     int64
 5   $40-50k             18 non-null     int64
 6   $50-75k             18 non-null     int64
 7   $75-100k            18 non-null     int64
 8   $100-150k           18 non-null     int64
 9   >150k               18 non-null     int64
 10  Don't know/refused  18 non-null     int64
dtypes: int64(10), object(1)
memory usage: 1.7+ KB

In [31]:
pew.head(3)

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54

In [38]:
pew

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [32]:
pd.melt(pew,id_vars='religion') #pew의 religion은 그대로 유지한채 나머지 컬럼들을 variable,value를 다 붙인다.

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [35]:
pew_long = pd.melt(pew,id_vars='religion')

In [36]:
pew_long.columns

Index(['religion', 'variable', 'value'], dtype='object')

In [37]:
pew_long.variable.value_counts()  #그

$10-20k               18
$50-75k               18
$30-40k               18
>150k                 18
$40-50k               18
<$10k                 18
$20-30k               18
$100-150k             18
Don't know/refused    18
$75-100k              18
Name: variable, dtype: int64

In [40]:
billboard = pd.read_csv('../data/billboard.csv') #두개 이상의 컬럼을 고정 시키고

In [47]:
billboard.info()
billboard.columns
billboard.values
billboard.sample(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 317 entries, 0 to 316
Data columns (total 81 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          317 non-null    int64
 1   artist        317 non-null    object
 2   track         317 non-null    object
 3   time          317 non-null    object
 4   date.entered  317 non-null    object
 5   wk1           317 non-null    int64
 6   wk2           312 non-null    float64
 7   wk3           307 non-null    float64
 8   wk4           300 non-null    float64
 9   wk5           292 non-null    float64
 10  wk6           280 non-null    float64
 11  wk7           269 non-null    float64
 12  wk8           260 non-null    float64
 13  wk9           253 non-null    float64
 14  wk10          244 non-null    float64
 15  wk11          236 non-null    float64
 16  wk12          222 non-null    float64
 17  wk13          210 non-null    float64
 18  wk14          204 non-null    float64
 19  wk15          197 non-null    float64
 20  wk16          182 non-null    float64
 21  wk17          177 non-null    float64
 22  wk18          166 non-null    float64
 23  wk19          156 non-null    float64
 24  wk20          146 non-null    float64
 25  wk21          65 non-null     float64
 26  wk22          55 non-null     float64
 27  wk23          48 non-null     float64
 28  wk24          46 non-null     float64
 29  wk25          38 non-null     float64
 30  wk26          36 non-null     float64
 31  wk27          29 non-null     float64
 32  wk28          24 non-null     float64
 33  wk29          20 non-null     float64
 34  wk30          20 non-null     float64
 35  wk31          19 non-null     float64
 36  wk32          18 non-null     float64
 37  wk33          12 non-null     float64
 38  wk34          10 non-null     float64
 39  wk35          9 non-null      float64
 40  wk36          9 non-null      float64
 41  wk37          9 non-null      float64
 42  wk38          8 non-null      float64
 43  wk39          8 non-null      float64
 44  wk40          7 non-null      float64
 45  wk41          7 non-null      float64
 46  wk42          6 non-null      float64
 47  wk43          6 non-null      float64
 48  wk44          6 non-null      float64
 49  wk45          5 non-null      float64
 50  wk46          5 non-null      float64
 51  wk47          5 non-null      float64
 52  wk48          4 non-null      float64
 53  wk49          4 non-null      float64
 54  wk50          4 non-null      float64
 55  wk51          4 non-null      float64
 56  wk52          4 non-null      float64
 57  wk53          4 non-null      float64
 58  wk54          2 non-null      float64
 59  wk55          2 non-null      float64
 60  wk56          2 non-null      float64
 61  wk57          2 non-null      float64
 62  wk58          2 non-null      float64
 63  wk59          2 non-null      float64
 64  wk60          2 non-null      float64
 65  wk61          2 non-null      float64
 66  wk62          2 non-null      float64
 67  wk63          2 non-null      float64
 68  wk64          2 non-null      float64
 69  wk65          1 non-null      float64
 70  wk66          0 non-null      float64
 71  wk67          0 non-null      float64
 72  wk68          0 non-null      float64
 73  wk69          0 non-null      float64
 74  wk70          0 non-null      float64
 75  wk71          0 non-null      float64
 76  wk72          0 non-null      float64
 77  wk73          0 non-null      float64
 78  wk74          0 non-null      float64
 79  wk75          0 non-null      float64
 80  wk76          0 non-null      float64
dtypes: float64(75), int64(2), object(4)
memory usage: 200.7+ KB

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
62,2000,Creed,Higher,5:16,1999-09-11,81,77.0,73.0,63.0,61.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
261,2000,"Simpson, Jessica",Where You Are,3:51,2000-04-01,73,66.0,62.0,62.0,76.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
166,2000,"Larrieux, Amel",Get Up,4:02,2000-03-04,100,97.0,97.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
billboard_long = pd.melt(billboard,id_vars=['year','artist','track','time','date.entered'],var_name='week',value_name='rating')

In [49]:
billboard_long

,year,artist,track,time,date.entered,week,rating
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0
...,...,...,...,...,...,...,...
24087,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,wk76,NaN
24088,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,wk76,NaN
24089,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,wk76,NaN
24090,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,wk76,NaN
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN

In [50]:
ebola = pd.read_csv('../data/country_timeseries.csv')

In [52]:
ebola.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122 entries, 0 to 121
Data columns (total 18 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 122 non-null    object
 1   Day                  122 non-null    int64
 2   Cases_Guinea         93 non-null     float64
 3   Cases_Liberia        83 non-null     float64
 4   Cases_SierraLeone    87 non-null     float64
 5   Cases_Nigeria        38 non-null     float64
 6   Cases_Senegal        25 non-null     float64
 7   Cases_UnitedStates   18 non-null     float64
 8   Cases_Spain          16 non-null     float64
 9   Cases_Mali           12 non-null     float64
 10  Deaths_Guinea        92 non-null     float64
 11  Deaths_Liberia       81 non-null     float64
 12  Deaths_SierraLeone   87 non-null     float64
 13  Deaths_Nigeria       38 non-null     float64
 14  Deaths_Senegal       22 non-null     float64
 15  Deaths_UnitedStates  18 non-null     float64
 16  Deaths_Spain         16 non-null     float64
 17  Deaths_Mali          12 non-null     float64
dtypes: float64(16), int64(1), object(1)
memory usage: 17.3+ KB

In [57]:
ebola_long= pd.melt(ebola,id_vars=['Date','Day'],var_name="temp",value_name='value')

In [54]:
ebola.shape   #122개 컬럼 18개

(122, 18)

In [55]:
ebola_long.shape   # 1952의 데이터, 컬럼 4개

(1952, 4)

In [58]:
ebola_long

            Date  Day          temp   value
0       1/5/2015  289  Cases_Guinea  2776.0
1       1/4/2015  288  Cases_Guinea  2775.0
2       1/3/2015  287  Cases_Guinea  2769.0
3       1/2/2015  286  Cases_Guinea     NaN
4     12/31/2014  284  Cases_Guinea  2730.0
...          ...  ...           ...     ...
1947   3/27/2014    5   Deaths_Mali     NaN
1948   3/26/2014    4   Deaths_Mali     NaN
1949   3/25/2014    3   Deaths_Mali     NaN
1950   3/24/2014    2   Deaths_Mali     NaN
1951   3/22/2014    0   Deaths_Mali     NaN

[1952 rows x 4 columns]

In [61]:
variable_split = ebola_long.temp.str.split('_')

In [62]:
type(variable_split)

pandas.core.series.Series

In [63]:
variable_split.head()  #리스트 형식으로 되어있다.근데 리스트인지 모르니깐 확실하게 확인해준다.

0    [Cases, Guinea]
1    [Cases, Guinea]
2    [Cases, Guinea]
3    [Cases, Guinea]
4    [Cases, Guinea]
Name: temp, dtype: object

In [64]:
type(variable_split[0])  #응 .. 리스트네

list

In [65]:
variable_split[0]

['Cases', 'Guinea']

In [66]:
#시리즈의 리스트를 앞과 뒤를 따로 빼는 작업을 한다.

status_value = variable_split.str.get(0)
country_value = variable_split.str.get(1)

In [67]:
status_value

0        Cases
1        Cases
2        Cases
3        Cases
4        Cases
         ...
1947    Deaths
1948    Deaths
1949    Deaths
1950    Deaths
1951    Deaths
Name: temp, Length: 1952, dtype: object

In [68]:
ebola_long['status'] = status_value #새 컬럼을 status로 만들어준다. 그다음 값을 대입

In [69]:
ebola_long['country'] = status_value

In [70]:
ebola_long.sample(4)

           Date  Day                temp  value  status country
1284  8/11/2014  142  Deaths_SierraLeone  334.0  Deaths  Deaths
358   3/31/2014    9   Cases_SierraLeone    2.0   Cases   Cases
795   8/13/2014  144         Cases_Spain    NaN   Cases   Cases
904   9/19/2014  181          Cases_Mali    NaN   Cases   Cases

In [ ]:
#여러 열을 하나로 정리

In [72]:
weather=pd.read_csv('../data/weather.csv')

In [73]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 35 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       22 non-null     object
 1   year     22 non-null     int64
 2   month    22 non-null     int64
 3   element  22 non-null     object
 4   d1       2 non-null      float64
 5   d2       4 non-null      float64
 6   d3       4 non-null      float64
 7   d4       2 non-null      float64
 8   d5       8 non-null      float64
 9   d6       2 non-null      float64
 10  d7       2 non-null      float64
 11  d8       2 non-null      float64
 12  d9       0 non-null      float64
 13  d10      2 non-null      float64
 14  d11      2 non-null      float64
 15  d12      0 non-null      float64
 16  d13      2 non-null      float64
 17  d14      4 non-null      float64
 18  d15      2 non-null      float64
 19  d16      2 non-null      float64
 20  d17      2 non-null      float64
 21  d18      0 non-null      float64
 22  d19      0 non-null      float64
 23  d20      0 non-null      float64
 24  d21      0 non-null      float64
 25  d22      0 non-null      float64
 26  d23      4 non-null      float64
 27  d24      0 non-null      float64
 28  d25      2 non-null      float64
 29  d26      2 non-null      float64
 30  d27      6 non-null      float64
 31  d28      2 non-null      float64
 32  d29      4 non-null      float64
 33  d30      2 non-null      float64
 34  d31      2 non-null      float64
dtypes: float64(31), int64(2), object(2)
memory usage: 6.1+ KB

In [74]:
weather.sample(3)  #데이터를 보니 id,year,month,element는 괜찮은데 d1~d31까지를 처리해야한다.

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
7,MX17004,2010,4,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,16.7,NaN,NaN,NaN,NaN
16,MX17004,2010,10,tmax,NaN,NaN,NaN,NaN,27.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,31.2,NaN,NaN,NaN
13,MX17004,2010,7,tmin,NaN,NaN,17.5,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [75]:
weather_melt = pd.melt(weather,id_vars=['id','year','month','element'],var_name='day',value_name='temp')

In [76]:
weather_melt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 682 entries, 0 to 681
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       682 non-null    object
 1   year     682 non-null    int64
 2   month    682 non-null    int64
 3   element  682 non-null    object
 4   day      682 non-null    object
 5   temp     66 non-null     float64
dtypes: float64(1), int64(2), object(3)
memory usage: 32.1+ KB

In [77]:
weather_melt.sample(4)

          id  year  month element  day  temp
275  MX17004  2010      6    tmin  d13   NaN
392  MX17004  2010     11    tmax  d18   NaN
335  MX17004  2010      3    tmin  d16  17.6
262  MX17004  2010     12    tmax  d12   NaN

In [82]:
weather_tidy = weather_melt.pivot_table(index=['id','year','month','day'],columns='element',values='temp',dropna=False)  #pivot_table     index, columns, values

In [83]:
weather_tidy

element                 tmax  tmin
id      year month day
MX17004 2010 1     d1    NaN   NaN
                   d10   NaN   NaN
                   d11   NaN   NaN
                   d12   NaN   NaN
                   d13   NaN   NaN
...                      ...   ...
             12    d5    NaN   NaN
                   d6   27.8  10.5
                   d7    NaN   NaN
                   d8    NaN   NaN
                   d9    NaN   NaN

[341 rows x 2 columns]

In [84]:
weather_tidy_flat = weather_tidy.reset_index() #인덱스를 새로 부여하는 함수  reset_index()

In [85]:
weather_tidy_flat

element       id  year  month  day  tmax  tmin
0        MX17004  2010      1   d1   NaN   NaN
1        MX17004  2010      1  d10   NaN   NaN
2        MX17004  2010      1  d11   NaN   NaN
3        MX17004  2010      1  d12   NaN   NaN
4        MX17004  2010      1  d13   NaN   NaN
..           ...   ...    ...  ...   ...   ...
336      MX17004  2010     12   d5   NaN   NaN
337      MX17004  2010     12   d6  27.8  10.5
338      MX17004  2010     12   d7   NaN   NaN
339      MX17004  2010     12   d8   NaN   NaN
340      MX17004  2010     12   d9   NaN   NaN

[341 rows x 6 columns]

In [87]:
weather_tidy_flat.index

RangeIndex(start=0, stop=341, step=1)

In [86]:
weather_tidy_flat.columns

Index(['id', 'year', 'month', 'day', 'tmax', 'tmin'], dtype='object', name='element')

In [88]:
billboard = pd.read_csv('../data/billboard.csv')

In [89]:
billboard.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 317 entries, 0 to 316
Data columns (total 81 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          317 non-null    int64
 1   artist        317 non-null    object
 2   track         317 non-null    object
 3   time          317 non-null    object
 4   date.entered  317 non-null    object
 5   wk1           317 non-null    int64
 6   wk2           312 non-null    float64
 7   wk3           307 non-null    float64
 8   wk4           300 non-null    float64
 9   wk5           292 non-null    float64
 10  wk6           280 non-null    float64
 11  wk7           269 non-null    float64
 12  wk8           260 non-null    float64
 13  wk9           253 non-null    float64
 14  wk10          244 non-null    float64
 15  wk11          236 non-null    float64
 16  wk12          222 non-null    float64
 17  wk13          210 non-null    float64
 18  wk14          204 non-null    float64
 19  wk15          197 non-null    float64
 20  wk16          182 non-null    float64
 21  wk17          177 non-null    float64
 22  wk18          166 non-null    float64
 23  wk19          156 non-null    float64
 24  wk20          146 non-null    float64
 25  wk21          65 non-null     float64
 26  wk22          55 non-null     float64
 27  wk23          48 non-null     float64
 28  wk24          46 non-null     float64
 29  wk25          38 non-null     float64
 30  wk26          36 non-null     float64
 31  wk27          29 non-null     float64
 32  wk28          24 non-null     float64
 33  wk29          20 non-null     float64
 34  wk30          20 non-null     float64
 35  wk31          19 non-null     float64
 36  wk32          18 non-null     float64
 37  wk33          12 non-null     float64
 38  wk34          10 non-null     float64
 39  wk35          9 non-null      float64
 40  wk36          9 non-null      float64
 41  wk37          9 non-null      float64
 42  wk38          8 non-null      float64
 43  wk39          8 non-null      float64
 44  wk40          7 non-null      float64
 45  wk41          7 non-null      float64
 46  wk42          6 non-null      float64
 47  wk43          6 non-null      float64
 48  wk44          6 non-null      float64
 49  wk45          5 non-null      float64
 50  wk46          5 non-null      float64
 51  wk47          5 non-null      float64
 52  wk48          4 non-null      float64
 53  wk49          4 non-null      float64
 54  wk50          4 non-null      float64
 55  wk51          4 non-null      float64
 56  wk52          4 non-null      float64
 57  wk53          4 non-null      float64
 58  wk54          2 non-null      float64
 59  wk55          2 non-null      float64
 60  wk56          2 non-null      float64
 61  wk57          2 non-null      float64
 62  wk58          2 non-null      float64
 63  wk59          2 non-null      float64
 64  wk60          2 non-null      float64
 65  wk61          2 non-null      float64
 66  wk62          2 non-null      float64
 67  wk63          2 non-null      float64
 68  wk64          2 non-null      float64
 69  wk65          1 non-null      float64
 70  wk66          0 non-null      float64
 71  wk67          0 non-null      float64
 72  wk68          0 non-null      float64
 73  wk69          0 non-null      float64
 74  wk70          0 non-null      float64
 75  wk71          0 non-null      float64
 76  wk72          0 non-null      float64
 77  wk73          0 non-null      float64
 78  wk74          0 non-null      float64
 79  wk75          0 non-null      float64
 80  wk76          0 non-null      float64
dtypes: float64(75), int64(2), object(4)
memory usage: 200.7+ KB

In [90]:
billboard.shape

(317, 81)

In [91]:
billboard.sample(3)

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
25,2000,"Backstreet Boys, The",The One,3:46,2000-05-27,58,50.0,43.0,37.0,31.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
118,2000,"Heatherly, Eric",Flowers On The Wall,3:16,2000-04-29,95,88.0,88.0,82.0,82.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
291,2000,Train,Meet Virginia,3:55,1999-10-09,76,67.0,59.0,54.0,48.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [93]:
billboard_melt = pd.melt(billboard,id_vars=['year','artist','track','time','date.entered'],var_name='day',value_name='value')

In [94]:
billboard_melt

,year,artist,track,time,date.entered,day,value
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0
...,...,...,...,...,...,...,...
24087,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,wk76,NaN
24088,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,wk76,NaN
24089,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,wk76,NaN
24090,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,wk76,NaN
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN

In [ ]:
#melt하기전과 후의 shape, info() 가 달라질 수 있다. 확인해보기  shape는 (데이터전체수,컬럼개수)

In [96]:
billboard_melt[billboard_melt.track=='Loser']   #track=='Loser' 인것만 뽑는다.   앞에 year, artist,tract ,time, date.entered 는 계속 같은 값이 반복되고 뒤에 day와 value만 다르다. 
# 앞에 5개 컬럼이 76번 반복 되버려서 분리시킨다.

       year        artist  track  time date.entered   day  value
3      2000  3 Doors Down  Loser  4:24   2000-10-21   wk1   76.0
320    2000  3 Doors Down  Loser  4:24   2000-10-21   wk2   76.0
637    2000  3 Doors Down  Loser  4:24   2000-10-21   wk3   72.0
954    2000  3 Doors Down  Loser  4:24   2000-10-21   wk4   69.0
1271   2000  3 Doors Down  Loser  4:24   2000-10-21   wk5   67.0
...     ...           ...    ...   ...          ...   ...    ...
22510  2000  3 Doors Down  Loser  4:24   2000-10-21  wk72    NaN
22827  2000  3 Doors Down  Loser  4:24   2000-10-21  wk73    NaN
23144  2000  3 Doors Down  Loser  4:24   2000-10-21  wk74    NaN
23461  2000  3 Doors Down  Loser  4:24   2000-10-21  wk75    NaN
23778  2000  3 Doors Down  Loser  4:24   2000-10-21  wk76    NaN

[76 rows x 7 columns]

In [97]:
billboard_songs = billboard_long[['year','artist','track','time','date.entered']] #billboard_long 원본 데이터

In [98]:
billboard_songs.info()   #만약에 컬럼이 1개를 대입해서 info찍으면 series로 가져오는데 여러개의 컬럼을 가져올 경우 DataFrame으로 바뀐다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24092 entries, 0 to 24091
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   year          24092 non-null  int64
 1   artist        24092 non-null  object
 2   track         24092 non-null  object
 3   time          24092 non-null  object
 4   date.entered  24092 non-null  object
dtypes: int64(1), object(4)
memory usage: 941.2+ KB

In [99]:
billboard_songs = billboard_songs.drop_duplicates()  #drop_duplicates 중복되는 값을 삭제한다. 최종 317건으로 줄어듬

In [100]:
billboard_songs

     year            artist                    track  time date.entered
0    2000             2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26
1    2000           2Ge+her  The Hardest Part Of ...  3:15   2000-09-02
2    2000      3 Doors Down               Kryptonite  3:53   2000-04-08
3    2000      3 Doors Down                    Loser  4:24   2000-10-21
4    2000          504 Boyz            Wobble Wobble  3:35   2000-04-15
..    ...               ...                      ...   ...          ...
312  2000       Yankee Grey     Another Nine Minutes  3:10   2000-04-29
313  2000  Yearwood, Trisha          Real Live Woman  3:55   2000-04-01
314  2000   Ying Yang Twins  Whistle While You Tw...  4:19   2000-03-18
315  2000     Zombie Nation            Kernkraft 400  3:30   2000-09-02
316  2000   matchbox twenty                     Bent  4:12   2000-04-29

[317 rows x 5 columns]

In [101]:
billboard_songs.shape

(317, 5)

In [ ]:
billboard_songs.head()

In [102]:
billboard_songs['id'] = range(len(billboard_songs)) #range는 0~99 / 이걸 하는 이유는 각각의 데이터앞에 id를 줄려고

In [ ]:
billboard_songs['index']= billboard_songs.index

In [103]:
billboard_songs

     year            artist                    track  time date.entered   id
0    2000             2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26    0
1    2000           2Ge+her  The Hardest Part Of ...  3:15   2000-09-02    1
2    2000      3 Doors Down               Kryptonite  3:53   2000-04-08    2
3    2000      3 Doors Down                    Loser  4:24   2000-10-21    3
4    2000          504 Boyz            Wobble Wobble  3:35   2000-04-15    4
..    ...               ...                      ...   ...          ...  ...
312  2000       Yankee Grey     Another Nine Minutes  3:10   2000-04-29  312
313  2000  Yearwood, Trisha          Real Live Woman  3:55   2000-04-01  313
314  2000   Ying Yang Twins  Whistle While You Tw...  4:19   2000-03-18  314
315  2000     Zombie Nation            Kernkraft 400  3:30   2000-09-02  315
316  2000   matchbox twenty                     Bent  4:12   2000-04-29  316

[317 rows x 6 columns]

In [ ]:
#concat은 원래 자기가 갖고 있는걸 합치는 거고 merge는 내가 사용할 컬럼을 이어준다.

In [113]:
billboard_songs[billboard_songs.id == billboard_songs.index]

     year            artist                    track  time date.entered   id
0    2000             2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26    0
1    2000           2Ge+her  The Hardest Part Of ...  3:15   2000-09-02    1
2    2000      3 Doors Down               Kryptonite  3:53   2000-04-08    2
3    2000      3 Doors Down                    Loser  4:24   2000-10-21    3
4    2000          504 Boyz            Wobble Wobble  3:35   2000-04-15    4
..    ...               ...                      ...   ...          ...  ...
312  2000       Yankee Grey     Another Nine Minutes  3:10   2000-04-29  312
313  2000  Yearwood, Trisha          Real Live Woman  3:55   2000-04-01  313
314  2000   Ying Yang Twins  Whistle While You Tw...  4:19   2000-03-18  314
315  2000     Zombie Nation            Kernkraft 400  3:30   2000-09-02  315
316  2000   matchbox twenty                     Bent  4:12   2000-04-29  316

[317 rows x 6 columns]

In [108]:
billboard_ratings = billboard_long.merge(billboard_songs,on=['year','artist','track','time','date.entered'])   #데이터는 중복됐지만 id값을 불러왔기때문에 성공

In [107]:
billboard_ratings

,year,artist,track,time,date.entered,week,rating,id
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0,0
1,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk2,82.0,0
2,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk3,72.0,0
3,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk4,77.0,0
4,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk5,87.0,0
...,...,...,...,...,...,...,...,...
24087,2000,matchbox twenty,Bent,4:12,2000-04-29,wk72,NaN,316
24088,2000,matchbox twenty,Bent,4:12,2000-04-29,wk73,NaN,316
24089,2000,matchbox twenty,Bent,4:12,2000-04-29,wk74,NaN,316
24090,2000,matchbox twenty,Bent,4:12,2000-04-29,wk75,NaN,316
24091,2000,matchbox twenty,Bent,4:12,2000-04-29,wk76,NaN,316

In [ ]:
#그 다음 중복된 ['year','artist','track','time','date.entered'] 이것들을 제거 시키고

In [109]:
billboard_ratings.drop(columns=['year','artist','track','time','date.entered'],inplace=True)  #inplace는 원본 삭제해버린다.

In [110]:
billboard_ratings.head(2)

  week  rating  id
0  wk1    87.0   0
1  wk2    82.0   0

In [111]:
billboard_songs.head(2)

   year   artist                    track  time date.entered  id
0  2000    2 Pac  Baby Don't Cry (Keep...  4:22   2000-02-26   0
1  2000  2Ge+her  The Hardest Part Of ...  3:15   2000-09-02   1

In [112]:
billboard_ratings.merge(billboard_songs,on=['id'])

,week,rating,id,year,artist,track,time,date.entered
0,wk1,87.0,0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26
1,wk2,82.0,0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26
2,wk3,72.0,0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26
3,wk4,77.0,0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26
4,wk5,87.0,0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26
...,...,...,...,...,...,...,...,...
24087,wk72,NaN,316,2000,matchbox twenty,Bent,4:12,2000-04-29
24088,wk73,NaN,316,2000,matchbox twenty,Bent,4:12,2000-04-29
24089,wk74,NaN,316,2000,matchbox twenty,Bent,4:12,2000-04-29
24090,wk75,NaN,316,2000,matchbox twenty,Bent,4:12,2000-04-29
24091,wk76,NaN,316,2000,matchbox twenty,Bent,4:12,2000-04-29